[
  {"q":"What is the goal of data continuity?","choices":["Prevent computer crashes","Maintain system availability and enable recovery after disruptions","Speed up the OS","Reduce power consumption"],"answer":1,"explain":"Data continuity ensures that systems remain available and recover quickly from failures."},
  {"q":"What does fault tolerance mean?","choices":["System continues to operate despite a component failure","System runs faster with more RAM","User cannot install apps","Backups stored in the cloud only"],"answer":0,"explain":"Fault tolerance allows systems to keep running when parts fail."},
  {"q":"What is the purpose of a contingency plan?","choices":["Overclock the CPU","Provide a structured response during crises","Install antivirus software","Document app licenses"],"answer":1,"explain":"Contingency plans guide recovery steps and responsibilities during incidents."},
  {"q":"Which RAID level provides no fault tolerance but high performance?","choices":["RAID 0","RAID 1","RAID 5","RAID 10"],"answer":0,"explain":"RAID 0 stripes data for speed but if one disk fails, all data is lost."},
  {"q":"RAID 1 is also called:","choices":["Disk striping","Disk mirroring","Parity striping","Hot-swapping"],"answer":1,"explain":"RAID 1 mirrors data across two drives for fault tolerance."},
  {"q":"Which RAID level uses striping with parity for redundancy?","choices":["RAID 0","RAID 1","RAID 5","RAID 2"],"answer":2,"explain":"RAID 5 balances performance and redundancy with parity data."},
  {"q":"What device provides temporary power during outages?","choices":["GPU","UPS","NIC","SSD"],"answer":1,"explain":"A UPS supplies short-term power and prevents sudden shutdowns."},
  {"q":"What is the only way to guarantee protection against total data loss?","choices":["Antivirus","RAID","Backups","Firewall"],"answer":2,"explain":"Only backups ensure data can be restored if the primary copy is lost."},
  {"q":"What is the difference between file backup and system backup?","choices":["File backup saves OS only, system backup saves apps","File backup saves selected files, system backup saves the whole drive","File backup is faster, system backup is slower","They are identical"],"answer":1,"explain":"File backups save specific files, system backups copy the entire system."},
  {"q":"What is an incremental backup?","choices":["Backs up all data every time","Backs up only files changed since last backup","Backs up data daily regardless","Backs up system image only"],"answer":1,"explain":"Incremental backups only copy changed files since the last backup."},
  {"q":"What is a system image?","choices":["A picture of a computer","A block-by-block copy of an entire drive","A log of OS files","A BIOS backup"],"answer":1,"explain":"System images capture the full state of a drive for recovery."},
  {"q":"Why is it important to test backups?","choices":["To reduce file size","To ensure data can be restored","To delete old files","To encrypt the OS"],"answer":1,"explain":"Backups are useless if they cannot be restored—testing is essential."},
  {"q":"Which backup location protects best against natural disasters?","choices":["On-site USB drive","External hard drive next to PC","Off-site or cloud storage","Second partition on the same drive"],"answer":2,"explain":"Off-site or cloud backups remain safe if local hardware is destroyed."},
  {"q":"What is the first step in troubleshooting methodology?","choices":["Establish a theory","Identify the problem","Restart the computer","Document findings"],"answer":1,"explain":"Troubleshooting starts with clearly identifying the problem."},
  {"q":"Which step comes after testing a theory?","choices":["Document findings","Verify functionality","Establish a plan of action","Identify the problem"],"answer":2,"explain":"Once a theory is tested, you must establish and implement a plan of action."},
  {"q":"What should you always do before troubleshooting?","choices":["Upgrade RAM","Back up important data","Reinstall the OS","Replace the hard drive"],"answer":1,"explain":"Protecting data comes first because hardware and software can be reinstalled."},
  {"q":"Which command tests connectivity to your own network adapter?","choices":["ping 127.0.0.1","ping www.google.com","ifconfig","netstat"],"answer":0,"explain":"127.0.0.1 is the loopback address for testing local adapter functionality."},
  {"q":"What does Safe Mode do on macOS?","choices":["Loads minimal drivers and performs disk check","Deletes all apps","Resets network settings","Runs BIOS"],"answer":0,"explain":"Safe Mode loads only core drivers and can help isolate problems."},
  {"q":"Why should you make one change at a time when troubleshooting?","choices":["To speed up fixes","To know exactly which change fixed the issue","To allow multiple fixes","To avoid backups"],"answer":1,"explain":"Changing one thing at a time makes troubleshooting clear and avoids new problems."},
  {"q":"What is the final step of troubleshooting methodology?","choices":["Establish theory","Verify fix","Document the work","Escalate issue"],"answer":2,"explain":"Documenting ensures future technicians can use your solution."}
]