[
  {"q":"What is the goal of data continuity?","choices":["Prevent computer crashes","Maintain system availability and enable recovery after disruptions","Speed up the OS","Reduce power consumption"],"answer":1,"explain":"Data continuity ensures that systems remain available and recover quickly from failures."},
  {"q":"What does fault tolerance mean?","choices":["System continues to operate despite a component failure","System runs faster with more RAM","User cannot install apps","Backups stored in the cloud only"],"answer":0,"explain":"Fault tolerance allows systems to keep running when parts fail."},
  {"q":"What is the purpose of a contingency plan?","choices":["Overclock the CPU","Provide a structured response during crises","Install antivirus software","Document app licenses"],"answer":1,"explain":"Contingency plans guide recovery steps and responsibilities during incidents."},
  {"q":"Which RAID level provides no fault tolerance but high performance?","choices":["RAID 0","RAID 1","RAID 5","RAID 10"],"answer":0,"explain":"RAID 0 stripes data for speed but if one disk fails, all data is lost."},
  {"q":"RAID 1 is also called:","choices":["Disk striping","Disk mirroring","Parity striping","Hot-swapping"],"answer":1,"explain":"RAID 1 mirrors data across two drives for fault tolerance."},
  {"q":"Which RAID level uses striping with parity for redundancy?","choices":["RAID 0","RAID 1","RAID 5","RAID 2"],"answer":2,"explain":"RAID 5 balances performance and redundancy with parity data."},
  {"q":"What device provides temporary power during outages?","choices":["GPU","UPS","NIC","SSD"],"answer":1,"explain":"A UPS supplies short-term power and prevents sudden shutdowns."},
  {"q":"What is the only way to guarantee protection against total data loss?","choices":["Antivirus","RAID","Backups","Firewall"],"answer":2,"explain":"Only backups ensure data can be restored if the primary copy is lost."},
  {"q":"What is the difference between file backup and system backup?","choices":["File backup saves OS only, system backup saves apps","File backup saves selected files, system backup saves the whole drive","File backup is faster, system backup is slower","They are identical"],"answer":1,"explain":"File backups save specific files, system backups copy the entire system."},
  {"q":"What is an incremental backup?","choices":["Backs up all data every time","Backs up only files changed since last backup","Backs up data daily regardless","Backs up system image only"],"answer":1,"explain":"Incremental backups only copy changed files since the last backup."},
  {"q":"What is a system image?","choices":["A picture of a computer","A block-by-block copy of an entire drive","A log of OS files","A BIOS backup"],"answer":1,"explain":"System images capture the full state of a drive for recovery."},
  {"q":"Why is it important to test backups?","choices":["To reduce file size","To ensure data can be restored","To delete old files","To encrypt the OS"],"answer":1,"explain":"Backups are useless if they cannot be restored—testing is essential."},
  {"q":"Which backup location protects best against natural disasters?","choices":["On-site USB drive","External hard drive next to PC","Off-site or cloud storage","Second partition on the same drive"],"answer":2,"explain":"Off-site or cloud backups remain safe if local hardware is destroyed."},
  {"q":"What is the first step in troubleshooting methodology?","choices":["Establish a theory","Identify the problem","Restart the computer","Document findings"],"answer":1,"explain":"Troubleshooting starts with clearly identifying the problem."},
  {"q":"Which step comes after testing a theory?","choices":["Document findings","Verify functionality","Establish a plan of action","Identify the problem"],"answer":2,"explain":"Once a theory is tested, you must establish and implement a plan of action."},
  {"q":"What should you always do before troubleshooting?","choices":["Upgrade RAM","Back up important data","Reinstall the OS","Replace the hard drive"],"answer":1,"explain":"Protecting data comes first because hardware and software can be reinstalled."},
  {"q":"Which command tests connectivity to your own network adapter?","choices":["ping 127.0.0.1","ping www.google.com","ifconfig","netstat"],"answer":0,"explain":"127.0.0.1 is the loopback address for testing local adapter functionality."},
  {"q":"What does Safe Mode do on macOS?","choices":["Loads minimal drivers and performs disk check","Deletes all apps","Resets network settings","Runs BIOS"],"answer":0,"explain":"Safe Mode loads only core drivers and can help isolate problems."},
  {"q":"Why should you make one change at a time when troubleshooting?","choices":["To speed up fixes","To know exactly which change fixed the issue","To allow multiple fixes","To avoid backups"],"answer":1,"explain":"Changing one thing at a time makes troubleshooting clear and avoids new problems."},
  {"q":"What is the final step of troubleshooting methodology?","choices":["Establish theory","Verify fix","Document the work","Escalate issue"],"answer":2,"explain":"Documenting ensures future technicians can use your solution."},
  {"q":"What are the main steps in a contingency plan?","choices":["BIA, preventive measures, recovery strategy, testing, maintenance, training","Install antivirus, update OS, backup files","Power off systems, call IT, wait","Ignore issues until resolved"],"answer":0,"explain":"A contingency plan includes business impact analysis, preventive actions, recovery, testing, maintenance, and training."},
  {"q":"What is the difference between replication and redundancy?","choices":["Replication copies data to multiple sites; redundancy provides backup components","Replication is faster; redundancy is slower","They are the same","Replication is a backup type; redundancy is a network term"],"answer":0,"explain":"Replication duplicates data across locations; redundancy involves extra hardware or paths to avoid failure."},
  {"q":"What is a hot site in disaster recovery?","choices":["A fully equipped off-site facility ready to take over immediately","A backup tape stored onsite","A network firewall","A mobile device"],"answer":0,"explain":"A hot site is a ready-to-use alternate location for business continuity."},
  {"q":"Which type of redundancy improves network availability?","choices":["Network redundancy","Power redundancy","Disk redundancy","Software redundancy"],"answer":0,"explain":"Network redundancy uses multiple paths or devices to ensure connectivity if one fails."},
  {"q":"Why is power redundancy important?","choices":["To keep systems running during power failure","To reduce electricity bills","To speed up processing","To prevent software crashes"],"answer":0,"explain":"Power redundancy ensures continuous operation during power outages using UPS or generators."},
  {"q":"Why is backup frequency important?","choices":["It determines how current your restored data will be","It affects network speed","It changes OS performance","It is irrelevant"],"answer":0,"explain":"More frequent backups reduce data loss but require more resources."},
  {"q":"What does backup scope refer to?","choices":["Which data is backed up","How fast backups run","Where backups are stored","Who performs backups"],"answer":0,"explain":"Scope defines whether files, systems, or applications are included in backups."},
  {"q":"Which backup type copies all selected data and resets archive bits?","choices":["Full (normal) backup","Copy backup","Incremental backup","Differential backup"],"answer":0,"explain":"Full backups copy everything and reset archive bits for incremental backups to track changes."},
  {"q":"What is a copy backup?","choices":["Copies selected files without affecting archive bits","Backs up only changed files","Backs up system image","Backs up daily files only"],"answer":0,"explain":"Copy backups do not reset archive bits and do not interfere with other backup types."},
  {"q":"What is a differential backup?","choices":["Backs up all changes since last full backup","Backs up all files every time","Backs up only new files","Backs up system image"],"answer":0,"explain":"Differential backups copy all changes made since the last full backup."},
  {"q":"Where is NAS typically used for backups?","choices":["On a local network for centralized storage","On a single PC only","In the cloud","On USB drives"],"answer":0,"explain":"NAS devices provide shared storage accessible over a local network."},
  {"q":"What is a key benefit of cloud backups?","choices":["Off-site storage and scalability","Faster local access","No internet needed","Lower security"],"answer":0,"explain":"Cloud backups protect data off-site and can grow with storage needs."},
  {"q":"What is a common method to ensure backup media reliability?","choices":["Rotating backup media regularly","Using only one backup device","Never testing backups","Backing up once a year"],"answer":0,"explain":"Rotating media reduces wear and risk of simultaneous failure."},
  {"q":"What does compliance mean in backup strategies?","choices":["Following legal and regulatory requirements","Ignoring backup schedules","Using free software only","Backing up only system files"],"answer":0,"explain":"Compliance ensures backups meet laws and company policies for data protection."},
  {"q":"What is the first step in disaster recovery?","choices":["Activate the disaster recovery plan","Backup data","Call the police","Turn off all systems"],"answer":0,"explain":"Disaster recovery begins by activating a predefined plan to manage the incident."},
  {"q":"Why is customer communication important during troubleshooting?","choices":["To understand the problem and set expectations","To sell new products","To delay work","To avoid responsibility"],"answer":0,"explain":"Clear communication helps identify problems and keeps customers informed."},
  {"q":"How do hardware and software issues differ in troubleshooting?","choices":["Hardware issues involve physical components; software issues involve programs","They are the same","Hardware issues are always easier","Software issues never cause failures"],"answer":0,"explain":"Hardware problems relate to physical parts; software problems relate to code or configurations."},
  {"q":"What is chip creep?","choices":["Gradual loosening of chips due to heat and vibration","A virus type","A software bug","A backup method"],"answer":0,"explain":"Chip creep is physical movement of chips causing intermittent hardware issues."},
  {"q":"Why use an anti-static wrist strap?","choices":["To prevent electrostatic discharge damaging components","To improve network speed","To cool the CPU","To clean hardware"],"answer":0,"explain":"Anti-static straps protect sensitive electronics from static electricity damage."},
  {"q":"What is a common cause of user error in troubleshooting?","choices":["Incorrect settings or actions by users","Hardware failure","Software bugs","Power failures"],"answer":0,"explain":"Users may cause issues by misconfiguration or incorrect use."},
  {"q":"Why is restarting a device often recommended?","choices":["It can clear temporary errors and refresh the system","It deletes viruses","It upgrades software","It increases hardware speed"],"answer":0,"explain":"Restarting resets system state and can resolve many issues."},
  {"q":"When should an issue be escalated?","choices":["When it cannot be resolved at the current support level","Immediately","Never","Only after hardware replacement"],"answer":0,"explain":"Escalation is needed for complex problems beyond current expertise."},
  {"q":"Why is documentation important in troubleshooting?","choices":["It records steps and solutions for future reference","It delays work","It confuses users","It is optional"],"answer":0,"explain":"Documentation helps track issues and aids other technicians."},
  {"q":"What macOS startup icon indicates a missing or corrupted startup disk?","choices":["Flashing question mark","Prohibition symbol","Spinning beach ball","Folder icon"],"answer":0,"explain":"A flashing question mark means the Mac can't find a valid startup disk."},
  {"q":"What does the prohibition symbol at macOS startup mean?","choices":["Incompatible or damaged OS","Normal startup","Battery low","Keyboard error"],"answer":0,"explain":"The prohibition symbol indicates the OS cannot be loaded due to incompatibility or corruption."},
  {"q":"How do you start Safe Mode on an Intel-based Mac?","choices":["Hold Shift key during startup","Hold Option key","Hold Command+R","Press power button twice"],"answer":0,"explain":"Holding Shift during boot forces macOS to load minimal drivers and disables startup items."},
  {"q":"How do you start Safe Mode on an Apple Silicon Mac?","choices":["Press and hold power button until startup options appear, then hold Shift and click Continue in Safe Mode","Hold Shift key","Hold Option key","Press Command+R"],"answer":0,"explain":"Apple Silicon Macs use a different process involving startup options to enter Safe Mode."},
  {"q":"What is macOS Recovery used for?","choices":["Reinstalling macOS, repairing disks, restoring from Time Machine","Installing apps","Changing desktop wallpaper","Updating firmware"],"answer":0,"explain":"macOS Recovery provides tools for system repair and reinstallation."},
  {"q":"How can you restore a Mac using Time Machine?","choices":["Boot into Recovery, choose Restore from Time Machine Backup","Drag files manually","Use Disk Utility only","Use Terminal commands"],"answer":0,"explain":"Time Machine backups can be restored through macOS Recovery environment."},
  {"q":"What tool helps identify processes causing macOS slowdown?","choices":["Activity Monitor","Disk Utility","Terminal","Finder"],"answer":0,"explain":"Activity Monitor shows CPU, memory, and disk usage of running processes."},
  {"q":"What can cause macOS overheating and slowdowns?","choices":["Blocked vents, heavy CPU usage, failing fans","Low disk space only","Battery issues only","Software updates"],"answer":0,"explain":"Physical issues and resource-heavy tasks can cause overheating and performance issues."},
  {"q":"What is Gatekeeper in macOS?","choices":["Security feature that controls app installation from untrusted sources","Backup software","Disk repair tool","Network utility"],"answer":0,"explain":"Gatekeeper prevents running unverified applications to protect the system."},
  {"q":"How do you force quit an unresponsive app on macOS?","choices":["Use Force Quit from the Apple menu or press Command+Option+Esc","Restart the Mac only","Delete the app","Run Disk Utility"],"answer":0,"explain":"Force Quit allows closing apps that are not responding."},
  {"q":"What might cause device failures on macOS?","choices":["Driver issues, hardware problems, connectivity errors","Only software bugs","Only user errors","Only outdated apps"],"answer":0,"explain":"Device failures can stem from drivers, hardware faults, or connection problems."},
  {"q":"Which command helps test network connectivity to the local machine?","choices":["ping 127.0.0.1","ping www.apple.com","traceroute","netstat"],"answer":0,"explain":"Pinging 127.0.0.1 tests the local network adapter functionality."},
  {"q":"What is the purpose of traceroute?","choices":["To trace the path packets take to a destination","To check disk usage","To list running processes","To update software"],"answer":0,"explain":"Traceroute shows the route and delays of packets across a network."}
]